hacker/_posts/2016-12-27-My Blogging Workflow Library.html
---
title: My Blogging Workflow Library
tagline: Check out this new post
blog-category: hacker
category:
- hacker
---

<div id="outline-container-org605a9d4" class="outline-2">
<h2 id="org605a9d4">Refactoring</h2>
<div class="outline-text-2" id="text-org605a9d4">
<p>
So I moved on to adding <b>The Watcher</b> blog which is an accomplishment
in moving from a single to multiple blog setup as well as challenge in
refactoring my scripts into a library and besides I need to refactor.
So the library is in <a href="https://github.com/FrancisMurillo/org-jekyll-blogger.el">org-jekyll-blogger.el</a> and here I talk about my
sensibilities.
</p>
</div>
</div>

<div id="outline-container-org8234bc7" class="outline-2">
<h2 id="org8234bc7">Initial Goals</h2>
<div class="outline-text-2" id="text-org8234bc7">
<p>
Since this a working version, here are my goals:
</p>

<ul class="org-ul">
<li>Create a draft</li>
<li>Post a draft</li>
<li>Find a post</li>
</ul>

<p>
At its core, that all I really want to do. Write and die. To explain
further this is the workflow: create a draft, do something else, find
the draft, thing again, maybe post it, sleep, sleep, review post for
errors, publish. That's kinda my workflow more or less.
</p>

<p>
So here I will talk about my experience in working with it
</p>
</div>
</div>

<div id="outline-container-orgabdcffd" class="outline-2">
<h2 id="orgabdcffd">Previous Structure</h2>
<div class="outline-text-2" id="text-orgabdcffd">
<p>
When I write a blog entry, I have to deal with to git repositories: my
private org posts and my public jekyll site. I have to emphasize
<b>private</b> and <b>public</b>, I would just have one structure to hold all
but one would see things that aren't ready for public consumption. The
good and sad thing about having a GitHub page. Copying repo commit
message is quite a contrivance.
</p>

<p>
So in my script I define a project and publish root both pointing to
said repositories. Through the magic of <code>org-publish</code> and
<code>org-publish-project-alist</code>, it is pretty trivial to convert the org
posts to jekyll compliant html files. So I guess there's nothing to
talk about there.
</p>

<p>
The challenge is converting this structure to support multiple blogs
which means multiple roots of sorts. So the design should support
multiple roots and update the use of publishing.
</p>
</div>
</div>

<div id="outline-container-orgcfc989a" class="outline-2">
<h2 id="orgcfc989a">Design</h2>
<div class="outline-text-2" id="text-orgcfc989a">
<p>
My design to create three objects:
</p>

<dl class="org-dl">
<dt><b>Project</b></dt><dd>This represents the root of the org post and the publishing to
the jekyll directory.</dd>
<dt><b>Blog</b></dt><dd>This represents a project blog structure.</dd>
<dt><b>Post</b></dt><dd>This represents a post(or draft) in a blog.</dd>
</dl>

<p>
Simple design really but took me a while to draft. I will elaborate on
the use of each one from a holistic sense.
</p>
</div>

<div id="outline-container-orge81b319" class="outline-3">
<h3 id="orge81b319">Project</h3>
<div class="outline-text-3" id="text-orge81b319">
<p>
A project is an object that holds primarily the project and publish
root. Aside from creating the folder for existence, it creates a
master or project publish command which triggers each related blog's
own publish command. So whenever a new blog is linked to a project,
it syncs the master publish command to include that blogs publish command.
</p>
</div>
</div>

<div id="outline-container-org071f045" class="outline-3">
<h3 id="org071f045">Blog</h3>
<div class="outline-text-3" id="text-org071f045">
<p>
A blog is an object that holds the meat of the blog structure. Also
it creates the blog structure that contains drafts, posts and images
and possibly more. More importantly it creates a blog publish command
which contains a content and asset publish command, it is faster to
use the content publish command than publish the whole project;
thankfully, there is <code>org-publish-current-file</code> which figures out
which command to use which finds the content publish.
</p>
</div>
</div>

<div id="outline-container-org7f4495a" class="outline-3">
<h3 id="org7f4495a">Post</h3>
<div class="outline-text-3" id="text-org7f4495a">
<p>
The actual content object which is the post or draft itself. In
this structure, one has to find the project, the blog directory, the
post or draft directory and then make the file there and also is a
nuance for a draft to just contain the title but a post must contain
a date prefix format so the command must do all those.
</p>
</div>
</div>
</div>

<div id="outline-container-orge2926cd" class="outline-2">
<h2 id="orge2926cd">Details</h2>
<div class="outline-text-2" id="text-orge2926cd">
<p>
Before I continue with the simple design, there are details that I
mulled over in creating this.
</p>
</div>

<div id="outline-container-org275ca95" class="outline-3">
<h3 id="org275ca95">Interface</h3>
<div class="outline-text-3" id="text-org275ca95">
<p>
So given all those ideas, the commands
<code>org-jekyll-blogger-create-draft</code> asks you to select a defined
project, then blogs from those project, then the name of the draft.
So I've been mulling over that single interface after experiencing
<code>magit</code>, <code>prodigy</code> and <code>helm</code>; is this multiple choice interface the
best representation?
</p>

<p>
The problem with my interface is that I only have one project and two
blogs but I still have to select them, a default or previously
selected scheme might work but I feel it might make the flow
inconsistent where you are working in one blog but want to work in
the other but got hampered by that scheme which I means a trade-off
between consistency and convenience. For now I am okay with a
consistent interface.
</p>

<p>
The other command that challenges this interface is
<code>org-jekyll-blogger-find-draft</code> which asks you to select a project
and blog then select a post or draft. The problem lies in the
representation and sorting, should you also sort draft and post date
and how will you display it. Since I am using <code>helm</code> I am more
inclined to display with a face and formatting, but what about <code>ivy</code>?
Or is better to display all project and blogs post and filter there?
</p>

<p>
So many questions but I guess the natural route would satisfy
<code>completing-read</code>. Having a custom buffer like <code>magit</code> or <code>prodigy</code>
is a thing to consider in making an interface.
</p>
</div>
</div>

<div id="outline-container-org1cc43b3" class="outline-3">
<h3 id="org1cc43b3">Alist vs Plist</h3>
<div class="outline-text-3" id="text-org1cc43b3">
<p>
In creating the objects, I did not want to use classes since I am a
functional programmer but rather I needed structs or records. So the
natural choice for me was to use an association list or alist. I like
the concept of list of key-value pairs but it isn't easy to write a
list of key properties. The alternative is to use a property list or
plist which is a list of paired symbols and values. For me it just
feels a little more symbolic and contextual.
</p>

<p>
The sad thing about plist is that it has no support for merging lists
and finding keys which is bonkers. I needed this simple functionality
to merge post options and headers. When working with jekyll, you have
to have preamble of org options and an front matter export block
header. So I decided to have default options and headers, passed to a
project, passed and merged by the blog options and headers, then
finally to a post which inserts into the post. So merging properties
is a key thing I need.
</p>

<p>
I don't need <code>dash</code> for a simple library such as this but
alternatives are <code>maps</code> and <code>kv</code> which depend on <code>dash</code> but also add
more functions that I don't need. Although I use them in my
configuration, I don't really need all the extra bulk. Merging
properties in an alist is simply appending lists but it looks ugly
once you print it out. So I wrote my own and I don't like the feel of
it that there is no native support for such but who am I to talk? But
that is one lesson, not adding extra dependencies when writing
libraries.
</p>

<p>
Between alist and plist, I like representing objects with plist but
not much in terms of functionality but support would be nice.
</p>
</div>
</div>

<div id="outline-container-org5d5db38" class="outline-3">
<h3 id="org5d5db38">Namespace</h3>
<div class="outline-text-3" id="text-org5d5db38">
<p>
Since my file name is <code>org-jekyll-blogger</code>, I have to name my library
the same but also prefix my functions with the same name which leads
to very long names such as <code>org-jekyll-blogger-post-draft</code>.
Thankfully, <code>smex</code> helps me get that name quick but the length and
typing is cumbersome specially when you're writing and testing it
out. I would rather type it though than have an abstraction layer of
typing namespacing which might just add a layer in testing it out but
I guess I'm good.
</p>

<p>
Another thing is the naming convention, whether to use a <code>/</code> or a <code>-</code>
to denote a namespace delimiter, then there is the double <code>--</code>
delimiter to represent private variables. Although <code>defcustom</code>,
<code>defvar</code> is enough to understand the intention, viewing it through
<code>describe-variable</code> does not say much. For example, <code>shm</code> has both
<code>/</code> and <code>-</code> to represent the public and private symbols. I am not
aware of a real solution for this but when writing my configuration,
I use my prefix <code>fn/</code> but when writing libraries I would write it as
<code>fn-</code>.
</p>

<p>
Aside from my gripes with it, it is not hard to follow but rather
jarring that modules aren't really a thing here. I wonder what the
<code>Zen of Python</code> has to say about it.
</p>
</div>
</div>
</div>

<div id="outline-container-org43ee639" class="outline-2">
<h2 id="org43ee639">Prototype</h2>
<div class="outline-text-2" id="text-org43ee639">
<p>
So with that, I crafted the simple library with three core commands:
</p>

<ul class="org-ul">
<li>org-jekyll-blogger-create-draft</li>
<li>org-jekyll-blogger-post-draft</li>
<li>org-jekyll-blogger-find-draft</li>
</ul>

<p>
I have to admit it was easy to write although I think slow. Sigh.
Instead of writing about it, here's a small screencast on what it
looks like&#x2026;
</p>

<p>
&#x2026; and my screencast tool is broken. Looks like I have a lot to
explain. I guess I'll just leave it that for now but honestly I have
to get all my tools working.
</p>
</div>
</div>

<div id="outline-container-org7d8eade" class="outline-2">
<h2 id="org7d8eade">Extra Features</h2>
<div class="outline-text-2" id="text-org7d8eade">
<p>
Simple really but I do note there are other features including the
leftovers from my original script such as:
</p>

<ul class="org-ul">
<li>Auto publish a post on save</li>
<li>Push to GitHub</li>
<li>Sync project blog structure to the published structure</li>
<li>Prodigy integration</li>
<li>Categories and tag completion</li>
</ul>

<p>
I can shiv the first one quite quickly, what's a post without a snippet?
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span>add-hook 'after-save-hook
          <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #7fff00;">()</span>
            <span style="color: #7fff00;">(</span><span style="color: #96a5d9; font-weight: bold;">save-excursion</span>
              <span style="color: #00bfff;">(</span>org-publish-current-file<span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>


<p>
I find it easy to add more features if I wanted. I foresee the use of
hooks and to add the git integration, structure sync and what not. I
am aware of an <code>org-jekyll</code> library but it is no longer used by the
author so it might not be doing the job he wants. Better to write your
own right? Right? If you're bored like me then yes.
</p>
</div>
</div>

<div id="outline-container-org1987690" class="outline-2">
<h2 id="org1987690">Working Flow</h2>
<div class="outline-text-2" id="text-org1987690">
<p>
Things are pretty much incremental and more to add on the wish list.
At least I am happy that I can write two blogs that challenge my
creativity more although I rarely write on one. Although my creativity
has been dipping, I will write or die trying.
</p>
</div>
</div>
